import queries as q


def main():

    if q.check_if_year_table_exists() is None:
        """
        Проверява дали приложението е стартирано за първи път и ако не е,
        изисква от потребителя да въведе година и цените за дневна и нощна тарифа,
        след това създава таблица с първоначалните данни за изразходваните киловати през деня и нощта
        и накрая създава таблиците за годината и за тарифите.
        """
        try:
            year = int(input('За да започнете да използвате приложението, въведете година: '))
            day_price = float(input('Въведете цена за дневна тарифа: '))
            night_price = float(input('Въведете цена за нощна тарифа: '))
            initial_day_kwhs = input('Въведете начална стойност на дневните показания на електромера: ')
            initial_night_kwhs = input('Въведете начална стойност на нощните показания на електромера: ')

            q.create_initial_data(initial_day_kwhs, initial_night_kwhs)
            q.create_year_table(year)
            q.create_price_table()
            q.update_price_table(day_price, night_price)

        except ValueError:
            print('Въведените данни са невалидни!\nИзползвайте само числа при въвеждането на годината,'
                  ' цените за тарифите и началните стойности на дневните и нощните показания на електромера!')
            input('Натиснете Enter, за да започнете отначало...')
            return main()


if __name__ == '__main__':
    main()
